In [1]:
import pandas as pd
import ast

### Nombre de titres d’achievement par pays ?

In [2]:
players=pd.read_csv("final/players.csv")

In [3]:
history=pd.read_csv("final/history.csv")

In [4]:
history.head()

,Unnamed: 0,playerid,achievementid,date_acquired,plateforme,acquired_year
0,0,1911732_playstation,670209_5436079,2024-11-28 10:23:24,playstation,2024
1,1,1911732_playstation,670209_5436078,2024-11-28 09:36:41,playstation,2024
2,2,1911732_playstation,670209_5436077,2024-11-28 08:31:54,playstation,2024
3,3,1911732_playstation,670209_5436076,2024-11-28 08:19:23,playstation,2024
4,4,1911732_playstation,658551_5368954,2024-10-05 13:12:35,playstation,2024

In [5]:
# reduire le nombre de colonnes 

history=history[['playerid', 'achievementid']]
history.head()

              playerid   achievementid
0  1911732_playstation  670209_5436079
1  1911732_playstation  670209_5436078
2  1911732_playstation  670209_5436077
3  1911732_playstation  670209_5436076
4  1911732_playstation  658551_5368954

In [6]:
players.head()

,Unnamed: 0,playerid,country,plateforme,created,created_year
0,0,2744567_playstation,Croatia,playstation,unknown,NaN
1,1,328452_playstation,United States,playstation,unknown,NaN
2,2,2521482_playstation,United Kingdom,playstation,unknown,NaN
3,3,390175_playstation,"Korea, Republic of",playstation,unknown,NaN
4,4,4348945_playstation,Russian Federation,playstation,unknown,NaN

In [7]:
# reduire le nombre de colonnes pour question de memoire ordinateur et faire le merge

players=players[['playerid', 'country']]
players.head()

              playerid             country
0  2744567_playstation             Croatia
1   328452_playstation       United States
2  2521482_playstation      United Kingdom
3   390175_playstation  Korea, Republic of
4  4348945_playstation  Russian Federation

In [8]:
# merge player et history sur le playerid 

players_history=players.merge(
  history,
  left_on =['playerid'],
  right_on =['playerid'],
  how='left'    
)

In [9]:
players_history.head()

              playerid             country achievementid
0  2744567_playstation             Croatia           NaN
1   328452_playstation       United States           NaN
2  2521482_playstation      United Kingdom           NaN
3   390175_playstation  Korea, Republic of           NaN
4  4348945_playstation  Russian Federation           NaN

In [10]:
players_history.shape

(46520773, 3)

In [11]:
players_history.isnull().sum()

playerid               0
country                0
achievementid    1040911
dtype: int64

### Nombre d'achievements uniques par pays

In [12]:

achievements_per_country = players_history.groupby("country")["achievementid"].nunique().reset_index().sort_values('achievementid', ascending=False)

In [13]:
achievements_per_country

           country  achievementid
82         Germany         863526
248        unknown         841988
234  United States         584945
111          Japan         579918
30          Brazil         501361
..             ...            ...
197     Seychelles              0
112         Jersey              0
195        Senegal              0
116       Kiribati              0
125        Liberia              0

[250 rows x 2 columns]

### Nombre total d'achievements par pays

In [18]:
# cela me paraît plus juste pour analyser la question initiale ( dans un pays nous pouvons avoir plusierus joueurs
# qui ont réalisé le meme achievement) 


nb_achievement_country = (players_history
    .groupby(['country']) 
    .count()                                
    .reset_index()            
    .sort_values(['achievementid'], ascending=[False]) 
#     .groupby('country')                  
#     .head(10)                              
)

nb_achievement_country

                   country  playerid  achievementid
248                unknown  18101397       17655450
234          United States   5747358        5637801
82                 Germany   2569950        2542343
233         United Kingdom   2487338        2438708
30                  Brazil   1675037        1624431
..                     ...       ...            ...
112                 Jersey        26              0
195                Senegal        29              0
116               Kiribati        31              0
193  Sao Tome and Principe         8              0
125                Liberia        19              0

[250 rows x 3 columns]

In [20]:
nb_achievement_country.columns = ["country","nb_of_players", "nb_of_achievements"]

nb_achievement_country

                   country  nb_of_players  nb_of_achievements
248                unknown       18101397            17655450
234          United States        5747358             5637801
82                 Germany        2569950             2542343
233         United Kingdom        2487338             2438708
30                  Brazil        1675037             1624431
..                     ...            ...                 ...
112                 Jersey             26                   0
195                Senegal             29                   0
116               Kiribati             31                   0
193  Sao Tome and Principe              8                   0
125                Liberia             19                   0

[250 rows x 3 columns]

### Normalisation après conseil de Victor

In [22]:

nb_achievement_country["avg_achievement_per_player"]=(nb_achievement_country["nb_of_achievements"]/nb_achievement_country["nb_of_players"]).round(2)

nb_achievement_country.head()

,country,nb_of_players,nb_of_achievements,avg_achievement_per_player
248,unknown,18101397,17655450,0.98
234,United States,5747358,5637801,0.98
82,Germany,2569950,2542343,0.99
233,United Kingdom,2487338,2438708,0.98
30,Brazil,1675037,1624431,0.97

In [23]:
# trier avg_nb_achievement par joueur

nb_achievement_country.sort_values(['avg_achievement_per_player'], ascending=[False])

,country,nb_of_players,nb_of_achievements,avg_achievement_per_player
129,Luxembourg,276852,276558,1.00
1,Albania,84565,84295,1.00
56,Cyprus,66146,65900,1.00
68,Estonia,66531,66028,0.99
13,Austria,245847,243324,0.99
...,...,...,...,...
241,"Virgin Islands, British",82,0,0.00
22,Benin,10,0,0.00
245,Yemen,70,0,0.00
6,Anguilla,24,0,0.00
125,Liberia,19,0,0.00

In [24]:
# enregistrer en csv 

nb_achievement_country.to_csv("powerbi/nb_achievement_par_pays.csv")